Documents/УдержаниеНалоговВзносовПоНУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УдержаниеНалоговВзносовПоНУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НалогиВзносыРасчетыНалогоплательщиков</xr:Item>
				<xr:Item>AccumulationRegister.НалогиВзносыОтчисленияРасчетыСБюджетомИФондами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НалогиВзносы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНалогаВзносаОтчисления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНалоговогоПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РегистрацияВНалоговомОргане</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДохода</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалогВзнос</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РучнаяКорректировка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/НалогиВзносыРасчетыНалогоплательщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>НалогиВзносыРасчетыНалогоплательщиков</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НалогВзнос</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНалоговогоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНалогаВзносаОтчисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДохода</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/УдержаниеНалоговВзносовПоНУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ДляВсехСтрок( ЗначениеРазрешено(НалогиВзносы.ФизическоеЛицо, NULL КАК ИСТИНА)
	|	) И ЗначениеРазрешено(Организация)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаОбъекта() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.УдержаниеНалоговВзносовПоНУ;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаОбъектаПоМетаданнымФизическиеЛицаВТабличныхЧастях(МетаданныеДокумента);
	
КонецФункции

#Область СлужебныеПроцедурыИФункции

Функция УдержанияНалоговВзносовПоНУОстатки(НалогиВзносы, Ссылка, Организация, ПериодРегистрации = Неопределено) Экспорт

	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("ВТФизЛица", НалогиВзносы);

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТФизЛица.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТФизЛица.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ВТФизЛица.НалогВзнос КАК НалогВзнос,
	|	ВТФизЛица.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТФизЛица
	|ИЗ
	|	&ВТФизЛица КАК ВТФизЛица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	МесяцНалоговогоПериода,
	|	ВидНалогаВзносаОтчисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ФизическоеЛицо КАК ФизическоеЛицо,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.НалогВзносПриход - НалогиВзносыРасчетыНалогоплательщиковОстатки.НалогВзносРасход КАК СуммаКПеречислению,
	|	НалогиВзносыРасчетыНалогоплательщиковОстатки.ВидДохода КАК ВидДохода
	|ПОМЕСТИТЬ ВТ_НалогиВзносыРасчетыНалогоплательщиков
	|ИЗ
	|	РегистрНакопления.НалогиВзносыРасчетыНалогоплательщиков.ОстаткиИОбороты(
	|			,
	|			,
	|			,
	|			,
	|			Организация = &Организация
	|				И (ФизическоеЛицо, МесяцНалоговогоПериода, ВидНалогаВзносаОтчисления, ВидДохода) В
	|					(ВЫБРАТЬ
	|						ВТФизЛица.ФизическоеЛицо,
	|						ВТФизЛица.МесяцНалоговогоПериода,
	|						ВТФизЛица.ВидНалогаВзносаОтчисления,
	|						ВТФизЛица.ВидДохода
	|					ИЗ
	|						ВТФизЛица КАК ВТФизЛица)) КАК НалогиВзносыРасчетыНалогоплательщиковОстатки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо,
	|	МесяцНалоговогоПериода,
	|	ВидНалогаВзносаОтчисления,
	|	ВидДохода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТФизЛица.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВТФизЛица.МесяцНалоговогоПериода КАК МесяцНалоговогоПериода,
	|	ВТФизЛица.ВидНалогаВзносаОтчисления КАК ВидНалогаВзносаОтчисления,
	|	ВЫБОР
	|		КОГДА ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВТФизЛица.НалогВзнос - ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению
	|	КОНЕЦ КАК СуммаОстаток,
	|	ВТФизЛица.ВидДохода КАК ВидДохода
	|ИЗ
	|	ВТФизЛица КАК ВТФизЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НалогиВзносыРасчетыНалогоплательщиков КАК ВТ_НалогиВзносыРасчетыНалогоплательщиков
	|		ПО ВТФизЛица.ФизическоеЛицо = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ФизическоеЛицо
	|			И ВТФизЛица.МесяцНалоговогоПериода = ВТ_НалогиВзносыРасчетыНалогоплательщиков.МесяцНалоговогоПериода
	|			И ВТФизЛица.ВидНалогаВзносаОтчисления = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ВидНалогаВзносаОтчисления
	|			И ВТФизЛица.ВидДохода = ВТ_НалогиВзносыРасчетыНалогоплательщиков.ВидДохода
	|			И ВТФизЛица.НалогВзнос > ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению
	|ГДЕ
	|	НЕ ВТ_НалогиВзносыРасчетыНалогоплательщиков.СуммаКПеречислению ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить();	

КонецФункции 

#КонецОбласти

#КонецЕсли
